# Review data quality

In [9]:
import configparser
import psycopg2
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

### Connect to Redshift cluster

In [22]:
config = configparser.ConfigParser()
config.read('dwh.cfg')

HOST=config.get("DWH","DWH_HOST")
DB_NAME=config.get("DWH","DWH_DB")
DB_USER=config.get("DWH","DWH_DB_USER")
DB_PASSWORD=config.get("DWH","DWH_DB_PASSWORD")
DB_PORT=config.get("DWH","DWH_PORT")

conn = psycopg2.connect(dbname=DB_NAME, user=DB_USER, password=DB_PASSWORD, host=HOST, port =DB_PORT)
cur = conn.cursor()

conn_string="postgresql://{}:{}@{}:{}/{}".format(DB_USER, DB_PASSWORD, HOST, DB_PORT, DB_NAME)
print(conn_string)
%sql $conn_string

postgresql://dwhuser:Passw0rd@dwhcluster.cwsikrn4kajq.us-west-2.redshift.amazonaws.com:5439/dwh

'Connected: dwhuser@dwh'

#### Check songplay for redundant data

In [55]:
query1 = '''
SELECT 
    COUNT(*)
FROM 
    songplayfact
'''
%sql $query1

 * postgresql://dwhuser:***@dwhcluster.cwsikrn4kajq.us-west-2.redshift.amazonaws.com:5439/dwh
1 rows affected.

[(333,)]

In [56]:
query2 = '''
SELECT 
    COUNT(*)
FROM (
    SELECT DISTINCT 
        start_time,
        user_id
    FROM 
        songplayfact
    )
'''
%sql $query2

 * postgresql://dwhuser:***@dwhcluster.cwsikrn4kajq.us-west-2.redshift.amazonaws.com:5439/dwh
1 rows affected.

[(333,)]

#### The count and distinct count based on start_time and user_id match, no redundant data. 

#### Check users table for duplicate users.

In [57]:
query3 = '''
SELECT TOP 1
    COUNT(*)
FROM 
    usersdim
GROUP BY 
    user_Id
ORDER BY 
    COUNT(*) DESC
'''
%sql $query3

 * postgresql://dwhuser:***@dwhcluster.cwsikrn4kajq.us-west-2.redshift.amazonaws.com:5439/dwh
1 rows affected.

[(1,)]

#### Top cound of user_id is 1 so no duplicates found. 

#### Check song table for duplicates

In [58]:
query4 = '''
SELECT TOP 1
    COUNT(*)
FROM 
    songdim
GROUP BY 
    song_id
ORDER BY 
    COUNT(*) DESC
'''
%sql $query3

 * postgresql://dwhuser:***@dwhcluster.cwsikrn4kajq.us-west-2.redshift.amazonaws.com:5439/dwh
1 rows affected.

[(1,)]

In [59]:
query5 = '''
SELECT TOP 5
    title,
    artist_id,
    year, 
    COUNT(*)
FROM 
    songdim
GROUP BY 
    title,
    artist_id,
    year
ORDER BY 
    COUNT(*) DESC
'''
%sql $query5

 * postgresql://dwhuser:***@dwhcluster.cwsikrn4kajq.us-west-2.redshift.amazonaws.com:5439/dwh
5 rows affected.

[('Moto Perpetuo_ Op. 11_ No. 2', 'ARKDO731187B98E21B', 2001, 2),
 ('The Earth Will Shake', 'ARIMZQZ1187B9AD541', 2005, 2),
 ('Day And Night', 'AR6AKW41187FB5B046', 0, 2),
 ('When I Grow Up', 'ARUYVDC12086C11D5C', 2009, 2),
 ('Commercial Reign', 'AR9AM2N1187B9AD2F1', 1990, 2)]

In [60]:
query6 = '''
SELECT
    *
FROM 
    songdim
WHERE
    artist_id = 'ARUYVDC12086C11D5C'
'''

%sql $query6

 * postgresql://dwhuser:***@dwhcluster.cwsikrn4kajq.us-west-2.redshift.amazonaws.com:5439/dwh
4 rows affected.

[('SOJDJRK12AB018565D', "I'm Not Done", 'ARUYVDC12086C11D5C', 2009, Decimal('280.24117')),
 ('SOKJUZQ12AB0185E37', 'When I Grow Up', 'ARUYVDC12086C11D5C', 2009, Decimal('556.06812')),
 ('SOJRTBO129F06A9450', 'Keep The Streets Empty For Me', 'ARUYVDC12086C11D5C', 2009, Decimal('337.08363')),
 ('SOIXAJN12AB0183EE3', 'When I Grow Up', 'ARUYVDC12086C11D5C', 2009, Decimal('335.54239'))]

#### No duplicate song_ids found, however some artists appear to have several songs with the same title in the same year? The duration is different so will assume all is ok. 

#### Check artist for duplicates

In [61]:
query7 = '''
SELECT TOP 10
    artist_id, 
    COUNT(*)
FROM 
    artistdim
GROUP BY 
    artist_id
ORDER BY 
    COUNT(*) DESC
'''
%sql $query7

 * postgresql://dwhuser:***@dwhcluster.cwsikrn4kajq.us-west-2.redshift.amazonaws.com:5439/dwh
10 rows affected.

[('AR06NFT1187B9B2902', 1),
 ('AR07SOR1187FB46179', 1),
 ('AR0BXMP1187FB474BB', 1),
 ('AR0IVTL1187B9AD520', 1),
 ('AR0KIXX1187B98AFCB', 1),
 ('AR0SG9V1187FB48F36', 1),
 ('AR0ZBRM1187FB54F5E', 1),
 ('AR0Z0DU1187FB3DF2E', 1),
 ('AR190KO1187B9905EC', 1),
 ('AR14QH31187FB39B79', 1)]

In [62]:
query8 = '''
SELECT
    *
FROM 
    artistdim
WHERE 
    artist_id = 'ARTE9CG1187B99B1AF'
'''

%sql $query8

 * postgresql://dwhuser:***@dwhcluster.cwsikrn4kajq.us-west-2.redshift.amazonaws.com:5439/dwh
1 rows affected.

[('ARTE9CG1187B99B1AF', 'DMX', '', None, None)]

#### Found several instances of artist_id duplicates. These have been removed within the insert statement using a windows function. 


#### Check time for duplicates.

In [63]:
query9 = '''
SELECT TOP 10
    start_time, 
    COUNT(*)
FROM 
    timedim
GROUP BY 
    start_time
ORDER BY 
    COUNT(*) DESC
'''
%sql $query9

 * postgresql://dwhuser:***@dwhcluster.cwsikrn4kajq.us-west-2.redshift.amazonaws.com:5439/dwh
10 rows affected.

[(datetime.datetime(2018, 11, 24, 11, 19, 6), 1),
 (datetime.datetime(2018, 11, 17, 16, 42, 29), 1),
 (datetime.datetime(2018, 11, 27, 16, 26, 4), 1),
 (datetime.datetime(2018, 11, 3, 19, 33, 39), 1),
 (datetime.datetime(2018, 11, 13, 17, 28, 33), 1),
 (datetime.datetime(2018, 11, 19, 6, 30, 8), 1),
 (datetime.datetime(2018, 11, 15, 12, 28, 39), 1),
 (datetime.datetime(2018, 11, 6, 8, 49, 19), 1),
 (datetime.datetime(2018, 11, 15, 10, 52, 20), 1),
 (datetime.datetime(2018, 11, 5, 18, 26, 7), 1)]